[
  {
    "position": "Data Engineer/ Python Developer",
    "companyName": "Charger Logistics Inc.",
    "jobLoc": "Delhi, Delhi",
    "jobType": "Remote",
    "jobDescription1": [
      "Developing large & sophisticated web applications using a Python web framework (Django, Flask, etc)",
      "Understanding in Object Oriented Python development",
      "Design, implement, and maintain large-scale batch and real-time scalable data pipelines with complex data transformations.",
      "Proficiency in web services and REST APIs",
      "Relational database development, specifically MS SQL Server, and experience in handling large dataset transactions",
      "Experience in HTML5, CSS3, and modern JavaScript frameworks",
      "A background in development with practical experience in Python for at least 2 years;",
      "Strong understanding of data structures, algorithms, development flows",
      "Experience and interest in cloud platforms",
      "Experience in developing large & sophisticated web applications using a Python web framework (Django, Flask, etc)",
      "Strong understanding in Object Oriented Python development",
      "Relational database development, specifically MS SQL Server, and experience in handling large dataset transactions",
      "Proficiency in web services and REST API",
      "ETL with integration services (SSIS)",
      "Experience working with Kafka",
      "Meaningful experience in extracting and loading data from multiple databases like RDBMS, NoSQL, and optionally BigData (Redshift, Snowflake, Hive)",
      "Real-world experience in JVM languages (Java, Scala).",
      "Working with data pipelines (Airflow, Argo Workflows, Kubeflow, etc).",
      "DevOps experience",
      "Test Automation Experience to help out on the other side if needed.",
      "Experience in HTML5, CSS3, and modern JavaScript frameworks",
      "Experience with Apache server",
      "Yes"
    ],
    "jobDescription2": [
      "Charger Logistics is a world class asset-based carrier. We specialize in delivering your assets, on time and on budget. With the diverse fleet of equipment, we can handle a range of freight, including dedicated loads, specialized hauls, temperature-controlled goods and HAZMAT cargo.",
      "Charger logistics invests time and support into its employees to provide them with the room to learn and grow their expertise and work their way up. We are entrepreneurial-minded organization that welcomes and support individual idea and strategies. Charger Logistics is seeking a well-rounded individual able to work in a fast-paced environment to join our team in India.",
      "**This will be a remote position, working from home**",
      "Responsibilities:",
      "Requirements:",
      "Mandatory Skills:",
      "Will be a plus:",
      "Job Type: Full-time",
      "Work Remotely:"
    ]
  },
  {
    "position": "DevOps Engineer",
    "companyName": "Smart Cookie Rewards Pvt Ltd",
    "jobLoc": "Pune, Maharashtra",
    "jobType": "Temporarily remote",
    "jobDescription1": [
      "Work from home",
      "Rotational shift",
      "total work: 1 year (Preferred)"
    ],
    "jobDescription2": [
      "DevOps Enginner",
      "The DevOps team is responsible for exposing blind spots in their applications and infrastructure, and then figuring out how they can monitor those services. Monitoring is just one small step into building highly observable systems – but it's an important start for building reliable systems",
      "Candidate should be expert on",
      "1 .AWS",
      "2. Version control-Git",
      "3 .Jenkins",
      "4. Jira",
      "5. Web Server (Apache, Tomcat, Ngnix)",
      "6. Databases (Mysql, SQL, Oracle)",
      "7.C-panel and Plesk panel",
      "8. Bitbucket",
      "9.Confluence",
      "Role of the DevOps Enginner",
      "Source Control Management– DevOps Engineer is expected to be aware of GIT and GIT workflows. The concepts of branches, merge, rebase, pull requests, push, commit, tags, etc. are quite important.",
      "·Continuous Integration– CI is the process of automation of code integrations from different developers or contributors into a single entity or build. A CI process often includes restoring, build, code analysis steps. Jenkins, Azure Pipelines, TeamCity, Travis CI, CircleCI are few popular tools available.",
      "· Configuration Management– CM is the process to automate, manage, monitor changes across servers, networks, storages, etc.",
      "· Deployment Automation– It is the process of automating the deployment after CI process creates a build.",
      "· Containerization– It is the process of operating system virtualization in which different applications are executed in their isolated spaces called as containers.",
      "· Cloud Platforms– Knowledge of a cloud platform is mandatory for a DevOps engineer. AWS, Azure, GCP are the most popular cloud platforms available.",
      "· Work Tracking– JIRA, Azure Boards are the most popular tools available.",
      "· Artifact Management– Artifactory, Azure Artifacts are the most popular tools available.",
      "candidate should be having own laptop or PC with good internet connection for WFH",
      "Job Type: Full-time",
      "Salary: ₹427,615.00 - ₹1,790,614.00 per year",
      "Benefits:",
      "Schedule:",
      "COVID-19 considerations:\nDue to Covid-19 we are providing work from home",
      "Experience:"
    ]
  },
  {
    "position": "Senior Software Development Engineer - Quality Engineering",
    "companyName": "MasterCard",
    "jobLoc": "Pune, Maharashtra",
    "jobType": "Temporarily remote",
    "jobDescription1": [],
    "jobDescription2": [""]
  },
  {
    "position": "Cloud Engineer",
    "companyName": "Presidio",
    "jobLoc": "Chennai, Tamil Nadu",
    "jobType": "Remote",
    "jobDescription1": [],
    "jobDescription2": []
  },
  {
    "position": "DevOps Engineer",
    "companyName": "SmartDocs Business Solutions Pvt. Ltd.",
    "jobLoc": "Hyderabad, Telangana",
    "jobType": "Remote",
    "jobDescription1": [
      "Cloud Platform: Microsoft Azure (Mandatory), GCP, AWS.",
      "Code Repository: GitHub",
      "Configuration Management tools: Chef & Puppet",
      "Deployment & Other tools: Kubernetes, Jenkins & Docker",
      "Scripting Languages: Shell & Python",
      "Data Base: Mongo DB & Elastic search",
      "As a part of the DevOps team, you will be responsible for configuration, optimization, documentation and support of the infrastructure components of SmartDocs software products.",
      "Diagnose and develop root cause solutions for failures and performance issues in our production environment.",
      "Evaluate new tools, technologies, and processes to improve speed, efficiency, and scalability of SmartDocs continuous integration environments.",
      "Monitor and Support deployment, Cloud based and On-premises Infrastructure.",
      "Handling of production infrastructure & provide support for systems.",
      "Assist in planning and reviewing application architecture and design to promote efficient deployment process.",
      "Troubleshoot server performance issues & handling of continuous integration system.",
      "Process automation using Shell Scripting & Python.",
      "System and application installation, configuration & maintenance.",
      "Collaborate with Technology Services team to manage server space, configuration and security.",
      "Perform all other duties as assigned related to Servers, Systems & networks.",
      "Cell phone reimbursement",
      "Flexible schedule",
      "Health insurance",
      "Internet reimbursement",
      "Paid sick time",
      "Work from home",
      "Flexible shift",
      "total work: 1 year (Preferred)"
    ],
    "jobDescription2": [
      "Job Synopsis:",
      "Are you a fun loving and passionate about technology? Are you ready to build a career that enhance your skills?",
      "Then, we are the right place to start your career in the field of Information Technology. We are totally committed about our employees, our customers, our work culture and especially our technology.",
      "The DevOps team plays a vital role in enabling SmartDocs to provide customers with our world class technology. They are the adhesive that binds the SmartDocs products together. We are an organization who encourages new ideas of employees through collaboration and creativity.",
      "We are seeking for an inventive DevOps engineer to join SmartDocs infrastructure team. The candidate will work with IT teams to provide solutions and be a subject matter expert in DevOps best practices, an ideal eligible candidate should have minimum 0 – 3 years of hands-on experience in Microsoft Azure Cloud platform.",
      "Core Competency:",
      "· B.Tech. / M.Tech in CSE / Software Engineering / IT or an equivalent combination of relevant education.",
      "· Passionate Fresher - 3 years of hands-on experience in the following tools & technologies:",
      "o Strong Knowledge with scripting and automated process management via shell scripting.",
      "o Excited by the opportunity to build highly scalable and world class products.",
      "o Eager and willing to work in a fast-paced environment.",
      "o Possesses intellectual humility: smart, driven, creative and able to learn things from slipups, willing to raise others up.",
      "o Someone who has a muzzle for business concerns and can drive them with technical goals.",
      "o Strong attitude for forward thinking of complex processes to eliminate manual processing.",
      "o Must be able to handle multiple tasks and adapt to a constantly changing environment.",
      "o Must have good understanding of SDLC.",
      "o Knowledge in Linux, Windows server, Monitoring tools and Shell scripting.",
      "o Knowledge with implementation of Java applications is added advantage.",
      "o Ability to use a wide variety of open-source technologies and cloud services.",
      "o Knowledge of best practices and IT operations in an always-up, always-available service.",
      "o Self-motivated; demonstrating the ability to achieve in technologies with minimal supervision.",
      "o Organized, flexible and analytical able to solve problems creatively.",
      "Key Responsibilities:",
      "SmartDocs, provide equal opportunities to all its employees and all qualified applicants for employment without regard to their race, caste, religion, color, ancestry, marital status, gender, sexual orientation, age, nationality, ethnic origin or disability. Our resource policies shall promote diversity and equality in the workplace while encouraging the adoption of international best practices.",
      "Job Type: Full-time",
      "Salary: ₹200,000.00 - ₹800,000.00 per year",
      "Benefits:",
      "Schedule:",
      "Experience:"
    ]
  },
  {
    "position": "Software Project Manager",
    "companyName": "Niswey",
    "jobLoc": "Remote",
    "jobType": "Remote",
    "jobDescription1": [],
    "jobDescription2": []
  },
  {
    "position": "Software Engineer",
    "companyName": "Sandvine",
    "jobLoc": "Bengaluru, Karnataka",
    "jobType": "Remote",
    "jobDescription1": [],
    "jobDescription2": ["", ""]
  },
  {
    "position": "Technical Support Engineer",
    "companyName": "Simplify360",
    "jobLoc": "Bengaluru, Karnataka",
    "jobType": "Remote",
    "jobDescription1": [
      "Cell phone reimbursement",
      "Health insurance",
      "Internet reimbursement",
      "Paid sick time",
      "Work from home",
      "Day shift",
      "Flexible shift",
      "Monday to Friday",
      "Night shift",
      "Rotational shift"
    ],
    "jobDescription2": [
      "Responsibilities",
      "· Debug issues Reported by the customer or analyzed by the L1 Team.",
      "· Provide Level 2 technical support.",
      "· Deploy updates and fixes.",
      "· Build tools to reduce occurrences of errors and improve customer experience.",
      "· Develop software to integrate with internal back-end systems.",
      "· Perform root cause analysis for production errors.",
      "· Investigate and resolve technical issues.",
      "· Develop scripts to automate visualization.",
      "· Design procedures for system troubleshooting and maintenance.",
      "Requirements",
      "· Knowledge of Java, J2EE and/or Python.",
      "· Knowledge of databases and SQL.",
      "· Knowledge of Solr or similar solutions.",
      "· Scripting knowledge and good knowledge of Linux.",
      "· Knowledge of Grafana, Prometheus would be an added plus.",
      "· BSc in Computer Science, Engineering or relevant field.",
      "· Good understanding in any of Cloud like AWS, Azure, Google cloud. IBM Cloud, Redhat OpenShift.",
      "· Knowledge of Docker and Kubernetes is required.",
      "Job Type: Full-time",
      "Salary: ₹250,000.00 - ₹300,000.00 per year",
      "Benefits:",
      "Schedule:"
    ]
  },
  {
    "position": "Lead Software Engineer - Sustenance Engineering - Remote",
    "companyName": "Icertis",
    "jobLoc": "Pune, Maharashtra",
    "jobType": "Remote",
    "jobDescription1": [],
    "jobDescription2": []
  },
  {
    "position": "Cloud DevOps Engineer",
    "companyName": "Autodesk",
    "jobLoc": "Bengaluru, Karnataka",
    "jobType": "Remote",
    "jobDescription1": [],
    "jobDescription2": []
  },
  {
    "position": "DevOps Engineer",
    "companyName": "IvyPods",
    "jobLoc": "Gurgaon, Haryana",
    "jobType": "Remote",
    "jobDescription1": [
      "Analyze current technology utilized within the company and develop steps and",
      "Work closely with engineers and developers to build and maintain the tools",
      "Seek to continually improve DevOps processes like deployments and",
      "Work alongside developers to build dashboards and platforms to efficiently",
      "Handle sudden spikes and anomalies in the shortest possible time and in a cost",
      "1-3 years of demonstrated experience in the field of DevOps (preferably in a fast",
      "Experience developing engineering applications for a large corporation",
      "Ability to optimize infrastructure-related costs (Past experience with video",
      "Deep understanding of best practices regarding system security measures",
      "Advanced application of various deployment platforms and techniques like",
      "Experience with scripting languages",
      "Professional experience and a high-level understanding of working with various",
      "Knowledge of containerized infrastructure deployment and serverless systems.",
      "Flexible schedule",
      "Health insurance",
      "Work from home",
      "Day shift",
      "Flexible shift",
      "Morning shift",
      "Total work: 1 year (Preferred)",
      "DevOps: 1 year (Preferred)",
      "Yes"
    ],
    "jobDescription2": [
      "We are hiring an experienced DevOps Engineer to help us keep growing. If you're\ndedicated and ambitious, Yellow Class (Ivypods Technology Pvt. Ltd.) is an excellent\nplace to grow your career. Don't hesitate to apply.",
      "Your Responsibilities",
      "processes to improve and expand upon them",
      "needed for projects to be completed efficiently",
      "infrastructure cost",
      "monitor system performance.",
      "effective manner",
      "Qualifications and Skills Needed",
      "growing startup).",
      "streaming at scale is a plus)",
      "Jenkins, Code-deploy, etc",
      "operating systems and their implications",
      "Job Type: Full-time",
      "Salary: Up to ₹1,500,000.00 per year",
      "Benefits:",
      "Schedule:",
      "Experience:",
      "Work Remotely:"
    ]
  }
]
